# Built-in Data Types to store Collections of Data

<img src="https://media.geeksforgeeks.org/wp-content/uploads/20191023173512/Python-data-structure.jpg" alt="Python Data-Types" />

Collections in python are basically container data types, namely lists, sets, tuples, dictionary.<BR>
They have different characteristics based on the declaration and the usage.<BR>
<ul>
    <li>A list is declared in square brackets, it is mutable, stores duplicate values and elements can be accessed using indexes.</li>
    <li>A tuple is ordered and immutable in nature, although duplicate entries can be there inside a tuple.</li>
    <li>A set is unordered and declared in square brackets. It is not indexed and does not have duplicate entries as well.</li>
    <li>A dictionary has key value pairs and is mutable in nature. We use square brackets to declare a dictionary.</li>
</ul>

<U><H1>SETS</H1></U>

Sets are used to store multiple items in a single variable.<BR>
Set items are :- 
- unordered, 
- unchangeable, 
- do not allow duplicate values.

Sets are written with curly brackets.

In [1]:
dataset = {1,2,3,4}
print("dataset -> ",dataset,"   ",type(dataset))

dataset ->  {1, 2, 3, 4}     <class 'set'>

<U><H1>Lists</H1></U>

Lists are used to store multiple items in a single variable.<BR>
List items are :-
- ordered, 
- changeable, 
- allow duplicate values.

List items are indexed, the first item has index [0], the second item has index [1] etc.<BR>
Lists are written with square brackets.

In [75]:
datalist = [1,2,3,4]
print("datalist -> ",datalist,"   ",type(datalist))

datalist ->  [1, 2, 3, 4]     <class 'list'>

<U><H1>TUPLES</H1></U>

Tuples are used to store multiple items in a single variable.<BR>
Tuple items are :-
1. ordered, 
2. unchangeable, 
3. allow duplicate values.

Tuples are written with round brackets.

In [76]:
datatuple = (1,"a",3,4)
print("datatuple -> ",datatuple,"   ",type(datatuple))

datatuple ->  (1, 'a', 3, 4)     <class 'tuple'>

<U><H1>DICTIONARIES</H1></U>

Dictionaries are used to store data values in key:value pairs.<BR>
Tuple items are :-
1. ordered, 
2. changeable, 
3. do not allow duplicate values.

Dictionaries are written with curly brackets, and have keys and values.

In [77]:
datadictionary = {1:"One", 2:"Two", 3:"Three", 4:"Four"}
print("datadictionary -> ",datadictionary,"   ",type(datadictionary))

datadictionary ->  {1: 'One', 2: 'Two', 3: 'Three', 4: 'Four'}     <class 'dict'>

# DATASET CREATION

In [78]:
import pandas as pd
import numpy as np

In [80]:
df = pd.Series(datadictionary, index = [1,2,3,4,5,6])

In [81]:
df

1      One
2      Two
3    Three
4     Four
5      NaN
6      NaN
dtype: object

# Student Data

#### Sno. | RollNo. | Name | Branch | Sem

In [82]:
def datacreate(dictionary):
    
    s_no = input("Enter S_No. : ")
    roll_no = input("Enter Roll_No. : ")
    name = input("Enter Name : ")
    branch = input("Enter Branch : ")
    sem = input("Enter Sem : ")
    
    dictionary[len(dictionary)] ={'S No.' : s_no,
                                  'R No.' : roll_no,
                                  'Name' : name,
                                  'Branch' : branch,
                                  'Sem' : sem}
    
    ch = input("Enter More? (Y/N) : ")
    if ch == 'Y' :
        dictionary = datacreate(dictionary)
    return dictionary

In [83]:
dictionary={}
dictionary=datacreate(dictionary)
df = pd.DataFrame(dictionary)

In [84]:
dataframe=df.T

In [86]:
dataframe

  S No.       R No.             Name  Branch Sem
0     1  1000015480   Divyanshi Sahu  B.Tech  VI
1     2  1000015445   Manimit Haldar  B.Tech  VI
2     3  1000015620  Aditya Bhatkoti    B.Sc   5
3     4  1000015613  Sandeep Chauhan    B.Ed   1
4     5  1000019855       Tony Stark     PhD   2
5     6  1000015796  Captain America     NCC   4

In [99]:
file_name = 'StudentData.xlsx'
dataframe.to_excel(file_name)
print('DataFrame is written to Excel File successfully.')

DataFrame is written to Excel File successfully.

# Working on BackUp Data

In [138]:
df=pd.read_excel(file_name)
df

   Unnamed: 0  S No.       R No.             Name  Branch Sem
0           0      1  1000015480   Divyanshi Sahu  B.Tech  VI
1           1      2  1000015445   Manimit Haldar  B.Tech  VI
2           2      3  1000015620  Aditya Bhatkoti    B.Sc  VI
3           3      4  1000015613  Sandeep Chauhan    B.Ed   I
4           4      5  1000019855       Tony Stark     PhD  II
5           5      6  1000015796  Captain America     NCC  IV

In [139]:
df=df.drop(df.index[2], inplace=False)
df=df.reset_index()
df

   index  Unnamed: 0  S No.       R No.             Name  Branch Sem
0      0           0      1  1000015480   Divyanshi Sahu  B.Tech  VI
1      1           1      2  1000015445   Manimit Haldar  B.Tech  VI
2      3           3      4  1000015613  Sandeep Chauhan    B.Ed   I
3      4           4      5  1000019855       Tony Stark     PhD  II
4      5           5      6  1000015796  Captain America     NCC  IV

In [140]:
df=df.drop("Unnamed: 0", axis=1)
df=df.drop("index", axis=1)
df

   S No.       R No.             Name  Branch Sem
0      1  1000015480   Divyanshi Sahu  B.Tech  VI
1      2  1000015445   Manimit Haldar  B.Tech  VI
2      4  1000015613  Sandeep Chauhan    B.Ed   I
3      5  1000019855       Tony Stark     PhD  II
4      6  1000015796  Captain America     NCC  IV